# Pandas series

In [11]:
import pandas as pd
a1 = pd.Series([1,2,3,4,5])
a1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
a = pd.Series(['a','b','c'])
a

0    a
1    b
2    c
dtype: object

In [8]:
d = pd.date_range(start = '01-01-2018', end = '23-5-2018')
d

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08',
               '2018-01-09', '2018-01-10',
               ...
               '2018-05-14', '2018-05-15', '2018-05-16', '2018-05-17',
               '2018-05-18', '2018-05-19', '2018-05-20', '2018-05-21',
               '2018-05-22', '2018-05-23'],
              dtype='datetime64[ns]', length=143, freq='D')

# DataFrame

In [14]:
import numpy as np
val1 = np.random.randint(low = 10, high = 100, size = [20,])
nam1 = np.random.choice(['Fahim','Sabbir','Jahid','Biplob'],20)
val2 = np.random.choice([10,11,12,13,14],20)

In [16]:
a = list(zip(val1,nam1,val2))

In [17]:
df = pd.DataFrame(data = a, columns = ['no','name','value'])
df

    no    name  value
0   34  Biplob     10
1   80   Fahim     14
2   61  Sabbir     12
3   55   Fahim     13
4   58   Fahim     13
5   36  Sabbir     14
6   41  Sabbir     11
7   87   Jahid     10
8   35   Fahim     14
9   28   Fahim     10
10  51   Jahid     12
11  62   Fahim     12
12  77  Sabbir     11
13  56  Sabbir     13
14  49   Jahid     13
15  67   Jahid     14
16  61   Jahid     11
17  43   Jahid     11
18  13  Biplob     11
19  75  Biplob     13

# data frame using dictionary

In [18]:
ddf = pd.DataFrame({'No': val1, 'Name':nam1, 'Number': val2})

In [19]:
ddf

    No    Name  Number
0   34  Biplob      10
1   80   Fahim      14
2   61  Sabbir      12
3   55   Fahim      13
4   58   Fahim      13
5   36  Sabbir      14
6   41  Sabbir      11
7   87   Jahid      10
8   35   Fahim      14
9   28   Fahim      10
10  51   Jahid      12
11  62   Fahim      12
12  77  Sabbir      11
13  56  Sabbir      13
14  49   Jahid      13
15  67   Jahid      14
16  61   Jahid      11
17  43   Jahid      11
18  13  Biplob      11
19  75  Biplob      13

In [20]:
ddf.head()

   No    Name  Number
0  34  Biplob      10
1  80   Fahim      14
2  61  Sabbir      12
3  55   Fahim      13
4  58   Fahim      13

In [21]:
ddf.tail()

    No    Name  Number
15  67   Jahid      14
16  61   Jahid      11
17  43   Jahid      11
18  13  Biplob      11
19  75  Biplob      13

In [22]:
ddf.shape

(20, 3)

In [25]:
ddf.columns

Index(['No', 'Name', 'Number'], dtype='object')

In [29]:
ddf.Name.head()

0    Biplob
1     Fahim
2    Sabbir
3     Fahim
4     Fahim
Name: Name, dtype: object

In [32]:
ddf['Name'].describe()

count        20
unique        4
top       Jahid
freq          6
Name: Name, dtype: object

In [33]:
ddf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
No        20 non-null int32
Name      20 non-null object
Number    20 non-null int32
dtypes: int32(2), object(1)
memory usage: 448.0+ bytes

In [34]:
ddf.values

array([[34, 'Biplob', 10],
       [80, 'Fahim', 14],
       [61, 'Sabbir', 12],
       [55, 'Fahim', 13],
       [58, 'Fahim', 13],
       [36, 'Sabbir', 14],
       [41, 'Sabbir', 11],
       [87, 'Jahid', 10],
       [35, 'Fahim', 14],
       [28, 'Fahim', 10],
       [51, 'Jahid', 12],
       [62, 'Fahim', 12],
       [77, 'Sabbir', 11],
       [56, 'Sabbir', 13],
       [49, 'Jahid', 13],
       [67, 'Jahid', 14],
       [61, 'Jahid', 11],
       [43, 'Jahid', 11],
       [13, 'Biplob', 11],
       [75, 'Biplob', 13]], dtype=object)

In [38]:
ddf.set_index('No', inplace= True)

In [41]:
ddf.sort_index(axis= 0,ascending= True).head()

      Name  Number
No
13  Biplob      11
28   Fahim      10
34  Biplob      10
35   Fahim      14
36  Sabbir      14

In [45]:
ddf.sort_values(by = 'Number' , ascending= True).head()

      Name  Number
No
34  Biplob      10
87   Jahid      10
28   Fahim      10
43   Jahid      11
61   Jahid      11

In [44]:
ddf.drop(labels= 'Number', axis= 1).head()

      Name
No
34  Biplob
80   Fahim
61  Sabbir
55   Fahim
58   Fahim

In [49]:
ddf.iloc[1:5,0]

No
80     Fahim
61    Sabbir
55     Fahim
58     Fahim
Name: Name, dtype: object

In [ ]:
ddf.loc[ddf.Number ]